**Задание 1**

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [21]:
movie = pd.read_csv('movies.csv')
movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [22]:
rating = pd.read_csv('ratings.csv')
rating.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [26]:
only_five = rating[rating['rating'] == 5.0]
only_five.head()

    userId  movieId  rating   timestamp
0        1      296     5.0  1147880044
2        1      307     5.0  1147868828
3        1      665     5.0  1147878820
8        1     1237     5.0  1147868839
18       1     2632     5.0  1147878248

In [44]:
only_five['movieId'].value_counts().head()

318     39553
296     32169
356     25918
260     25804
2571    25482
Name: movieId, dtype: int64

In [49]:
movie[(movie['movieId'] == 318)]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

**Задание 2**

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [20]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [33]:
filtered_years = data[ ((data['year'] >= 2005) & (data['year'] <= 2010)) ]

filtered_years.head()

    country  year  quantity  category
6   Belgium  2010      22.0         1
7   Belgium  2009      45.0         1
10  Finland  2010       9.0         1
11  Finland  2009      13.0         1
12  Finland  2008      39.0         1

In [34]:
filtered_quantity = filtered_years[ (filtered_years['quantity'] >= 0) ]
filtered_quantity.head()

    country  year  quantity  category
6   Belgium  2010      22.0         1
7   Belgium  2009      45.0         1
10  Finland  2010       9.0         1
11  Finland  2009      13.0         1
12  Finland  2008      39.0         1

In [35]:
filtered_category = filtered_quantity[ (filtered_quantity['category'] == 4) | (filtered_quantity['category'] == 12) | (filtered_quantity['category'] == 21)]
filtered_category.head()

        country  year  quantity  category
9838  Swaziland  2010    0.1800         4
9839  Swaziland  2009    0.2100         4
9840  Swaziland  2008    0.3100         4
9841  Swaziland  2007    0.3080         4
9842  Swaziland  2006    0.2957         4

In [36]:
data[ data['country'].str.contains('lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [37]:
data[ data['country'].str.contains('lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [38]:
data[ data['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [39]:
filtered_countries = filtered_category[ (filtered_category['country']=='Latvia') | (filtered_category['country']=='Lithuania')| (filtered_category['country']=='Estonia') ]

filtered_countries.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [40]:
sum_pribalt = filtered_countries.sum()['quantity']
print(sum_pribalt)

240580.0

**Задание 3**

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти): 
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [7]:
page = 'https://fortrader.org/quotes'

In [12]:
df = pd.read_html(page, encoding='utf-8')

In [16]:
df[0]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,EURRUB Курс евро к рублю сегодня,78.0626,0.0,0.0,NaN
1,USDRUB Курс рубля к доллару,69.6801,0.0,0.0,NaN